<a href="https://colab.research.google.com/github/rashidov9797/Data_Science_homeworks/blob/main/Qayta_shakllantirish.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [30]:
import pandas as pd
import numpy as np

Multi indexlash

In [ ]:
data = -pd.Series(np.random.randn(9),index=['a','a','b','b','a','c','c','d','d'])

In [ ]:
data

a    1.035663
a    0.622064
b   -0.779724
b    1.095155
a   -1.290201
c    0.297435
c    0.500046
d    0.510569
d   -0.644162
dtype: float64

In [ ]:
data1 = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],[1, 2, 3, 1, 3, 1, 2, 2, 3]])

In [ ]:
data1

a  1   -2.327993
   2    1.354436
   3   -1.516069
b  1    1.270438
   3   -0.377271
c  1    2.343829
   2    0.462391
d  2    0.642410
   3   -1.727763
dtype: float64

In [ ]:
data1.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [ ]:
data1['a']

2    1.554163
2   -0.639493
7    0.210679
dtype: float64

In [ ]:
data1.loc[:,2] #Barcha 2-indexdagi ma'lumotni chiqar

a    1.554163
a   -0.639493
d    1.618947
dtype: float64

In [ ]:
data1.loc[['b','d']]

b  4    1.461086
   6   -0.204060
d  2    1.618947
   5   -0.953784
dtype: float64

Unstack va Stack orqali indexlash

In [ ]:
data1

a  2    1.554163
   2   -0.639493
b  4    1.461086
   6   -0.204060
a  7    0.210679
c  5   -0.248506
   5    0.764707
d  2    1.618947
   5   -0.953784
dtype: float64

In [ ]:
data1.unstack() # sochilgan Seriesni df ko'rinishida olish

          1         2         3
a -2.327993  1.354436 -1.516069
b  1.270438       NaN -0.377271
c  2.343829  0.462391       NaN
d       NaN  0.642410 -1.727763

In [ ]:
# stack usulida df ni Seriesga oberadi
data1.unstack().stack()

a  1   -2.327993
   2    1.354436
   3   -1.516069
b  1    1.270438
   3   -0.377271
c  1    2.343829
   2    0.462391
d  2    0.642410
   3   -1.727763
dtype: float64

In [ ]:
data1.unstack()

          1         2         3
a -2.327993  1.354436 -1.516069
b  1.270438       NaN -0.377271
c  2.343829  0.462391       NaN
d       NaN  0.642410 -1.727763

Datasetlar orqali ko'rish

In [ ]:
!git clone https://github.com/MansurCompAI/Practicum_Datasets.git

Cloning into 'Practicum_Datasets'...
remote: Enumerating objects: 23, done.
remote: Counting objects: 100% (23/23), done.
remote: Compressing objects: 100% (20/20), done.
remote: Total 23 (delta 4), reused 10 (delta 1), pack-reused 0
Unpacking objects: 100% (23/23), done.

In [ ]:
df = pd.read_csv("/content/Practicum_Datasets/world_cities_air_water_quality.csv")

In [ ]:
df

                  City  ...  "WaterPollution"
0        New York City  ...         49.504950
1     Washington, D.C.  ...         49.107143
2        San Francisco  ...         43.000000
3               Berlin  ...         28.612717
4          Los Angeles  ...         61.299435
...                ...  ...               ...
3958             Yanbu  ...         50.000000
3959           Cordoba  ...          8.333333
3960               Vic  ...          0.000000
3961           Segovia  ...          0.000000
3962       Zamora city  ...         50.000000

[3963 rows x 5 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3963 entries, 0 to 3962
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   City               3963 non-null   object
 1    "Region"          3963 non-null   object
 2    "Country"         3963 non-null   object
 3    "AirQuality"      3963 non-null   float64
 4    "WaterPollution"  3963 non-null   float64
dtypes: float64(2), object(3)
memory usage: 154.9+ KB

In [ ]:
columns = ['City','Region','Country','AirQuality','WaterPollution']
df.columns = columns

In [ ]:
df

                  City                   Region  ...  AirQuality  WaterPollution
0        New York City               "New York"  ...   46.816038       49.504950
1     Washington, D.C.   "District of Columbia"  ...   66.129032       49.107143
2        San Francisco             "California"  ...   60.514019       43.000000
3               Berlin                       ""  ...   62.364130       28.612717
4          Los Angeles             "California"  ...   36.621622       61.299435
...                ...                      ...  ...         ...             ...
3958             Yanbu        "Medina Province"  ...    0.000000       50.000000
3959           Cordoba              "Andalusia"  ...   85.714286        8.333333
3960               Vic              "Catalonia"  ...  100.000000        0.000000
3961           Segovia       "Castile and Leon"  ...  100.000000        0.000000
3962       Zamora city       "Castile and Leon"  ...  100.000000       50.000000

[3963 rows x 5 columns]

In [ ]:
# " " belgisini olamiz

df['Region'] = df['Region'].map(lambda x: x.replace('"',""))
df

                  City                 Region  ...  AirQuality  WaterPollution
0        New York City               New York  ...   46.816038       49.504950
1     Washington, D.C.   District of Columbia  ...   66.129032       49.107143
2        San Francisco             California  ...   60.514019       43.000000
3               Berlin                         ...   62.364130       28.612717
4          Los Angeles             California  ...   36.621622       61.299435
...                ...                    ...  ...         ...             ...
3958             Yanbu        Medina Province  ...    0.000000       50.000000
3959           Cordoba              Andalusia  ...   85.714286        8.333333
3960               Vic              Catalonia  ...  100.000000        0.000000
3961           Segovia       Castile and Leon  ...  100.000000        0.000000
3962       Zamora city       Castile and Leon  ...  100.000000       50.000000

[3963 rows x 5 columns]

In [ ]:
df['Country'] = df['Country'].map(lambda x: x.replace('"',""))

In [ ]:
df

                  City                 Region  ...  AirQuality  WaterPollution
0        New York City               New York  ...   46.816038       49.504950
1     Washington, D.C.   District of Columbia  ...   66.129032       49.107143
2        San Francisco             California  ...   60.514019       43.000000
3               Berlin                         ...   62.364130       28.612717
4          Los Angeles             California  ...   36.621622       61.299435
...                ...                    ...  ...         ...             ...
3958             Yanbu        Medina Province  ...    0.000000       50.000000
3959           Cordoba              Andalusia  ...   85.714286        8.333333
3960               Vic              Catalonia  ...  100.000000        0.000000
3961           Segovia       Castile and Leon  ...  100.000000        0.000000
3962       Zamora city       Castile and Leon  ...  100.000000       50.000000

[3963 rows x 5 columns]

In [ ]:
df.to_csv('Update_dataset.csv',index=False)

In [ ]:
# space ni olib tashlasg

df['Country']=df['Country'].map(lambda x: x.strip())

In [ ]:
df['Country'][3]

'Germany'

In [ ]:
df[df['Country']=='Uzbekistan']

        City Region     Country  AirQuality  WaterPollution
21  Tashkent         Uzbekistan   56.451613       49.166667

Multi index berish

In [ ]:
df

                  City                 Region  ...  AirQuality  WaterPollution
0        New York City               New York  ...   46.816038       49.504950
1     Washington, D.C.   District of Columbia  ...   66.129032       49.107143
2        San Francisco             California  ...   60.514019       43.000000
3               Berlin                         ...   62.364130       28.612717
4          Los Angeles             California  ...   36.621622       61.299435
...                ...                    ...  ...         ...             ...
3958             Yanbu        Medina Province  ...    0.000000       50.000000
3959           Cordoba              Andalusia  ...   85.714286        8.333333
3960               Vic              Catalonia  ...  100.000000        0.000000
3961           Segovia       Castile and Leon  ...  100.000000        0.000000
3962       Zamora city       Castile and Leon  ...  100.000000       50.000000

[3963 rows x 5 columns]

In [ ]:
# PIVOT_TABLE - 

df1 = pd.pivot_table(df,index=['Country','City'])

In [ ]:
df1.index

MultiIndex([('Afghanistan',        'Andkhoy'),
            ('Afghanistan',          'Farah'),
            ('Afghanistan',          'Herat'),
            ('Afghanistan',          'Kabul'),
            ('Afghanistan',       'Kandahar'),
            ('Afghanistan', 'Mazar-i-Sharif'),
            (    'Albania',         'Ballsh'),
            (    'Albania',         'Burrel'),
            (    'Albania',         'Durres'),
            (    'Albania',        'Elbasan'),
            ...
            (      'Yemen',          'Sanaa'),
            (      'Yemen',         'Ta'izz'),
            (     'Zambia',       'Chingola'),
            (     'Zambia',          'Kitwe'),
            (     'Zambia',         'Lusaka'),
            (     'Zambia',          'Mansa'),
            (   'Zimbabwe',        'Bindura'),
            (   'Zimbabwe',       'Bulawayo'),
            (   'Zimbabwe',         'Harare'),
            (   'Zimbabwe',       'Masvingo')],
           names=['Country', 'City'], length=3895)

In [ ]:
df2 = df1.copy()
df2

                      AirQuality  WaterPollution
Country     City
Afghanistan Andkhoy    50.000000       50.000000
            Farah     100.000000        0.000000
            Herat      43.750000       31.250000
            Kabul      18.421053       81.060606
            Kandahar    0.000000       75.000000
...                          ...             ...
Zambia      Mansa      75.000000       25.000000
Zimbabwe    Bindura    50.000000       75.000000
            Bulawayo   67.857143       71.428571
            Harare     38.461538       87.500000
            Masvingo   25.000000       62.500000

[3895 rows x 2 columns]

In [ ]:
df2['AirPollution'] = 100-df2['AirQuality']

In [ ]:
df2

                      AirQuality  WaterPollution  AirPollution
Country     City
Afghanistan Andkhoy    50.000000       50.000000     50.000000
            Farah     100.000000        0.000000      0.000000
            Herat      43.750000       31.250000     56.250000
            Kabul      18.421053       81.060606     81.578947
            Kandahar    0.000000       75.000000    100.000000
...                          ...             ...           ...
Zambia      Mansa      75.000000       25.000000     25.000000
Zimbabwe    Bindura    50.000000       75.000000     50.000000
            Bulawayo   67.857143       71.428571     32.142857
            Harare     38.461538       87.500000     61.538462
            Masvingo   25.000000       62.500000     75.000000

[3895 rows x 3 columns]

In [ ]:
df2['WaterQuality'] = 100-df2['WaterPollution']

In [ ]:
df2

                      AirQuality  WaterPollution  AirPollution  WaterQuality
Country     City
Afghanistan Andkhoy    50.000000       50.000000     50.000000     50.000000
            Farah     100.000000        0.000000      0.000000    100.000000
            Herat      43.750000       31.250000     56.250000     68.750000
            Kabul      18.421053       81.060606     81.578947     18.939394
            Kandahar    0.000000       75.000000    100.000000     25.000000
...                          ...             ...           ...           ...
Zambia      Mansa      75.000000       25.000000     25.000000     75.000000
Zimbabwe    Bindura    50.000000       75.000000     50.000000     25.000000
            Bulawayo   67.857143       71.428571     32.142857     28.571429
            Harare     38.461538       87.500000     61.538462     12.500000
            Masvingo   25.000000       62.500000     75.000000     37.500000

[3895 rows x 4 columns]

In [ ]:
df3 = pd.DataFrame(df2.values,index=df2.index,
  columns=[['AIR','AIR','WATER','WATER'],['AirQuality','AirPollution','WaterQuality','WaterPollution']])

In [ ]:
df3

                             AIR                     WATER
                      AirQuality AirPollution WaterQuality WaterPollution
Country     City
Afghanistan Andkhoy    50.000000    50.000000    50.000000      50.000000
            Farah     100.000000     0.000000     0.000000     100.000000
            Herat      43.750000    31.250000    56.250000      68.750000
            Kabul      18.421053    81.060606    81.578947      18.939394
            Kandahar    0.000000    75.000000   100.000000      25.000000
...                          ...          ...          ...            ...
Zambia      Mansa      75.000000    25.000000    25.000000      75.000000
Zimbabwe    Bindura    50.000000    75.000000    50.000000      25.000000
            Bulawayo   67.857143    71.428571    32.142857      28.571429
            Harare     38.461538    87.500000    61.538462      12.500000
            Masvingo   25.000000    62.500000    75.000000      37.500000

[3895 rows x 4 columns]

In [ ]:
df3['AIR']

                      AirQuality  AirPollution
Country     City
Afghanistan Andkhoy    50.000000     50.000000
            Farah     100.000000      0.000000
            Herat      43.750000     31.250000
            Kabul      18.421053     81.060606
            Kandahar    0.000000     75.000000
...                          ...           ...
Zambia      Mansa      75.000000     25.000000
Zimbabwe    Bindura    50.000000     75.000000
            Bulawayo   67.857143     71.428571
            Harare     38.461538     87.500000
            Masvingo   25.000000     62.500000

[3895 rows x 2 columns]

In [ ]:
df3.columns.names = ['Object','Info']
df3

Object                       AIR                     WATER
Info                  AirQuality AirPollution WaterQuality WaterPollution
Country     City
Afghanistan Andkhoy    50.000000    50.000000    50.000000      50.000000
            Farah     100.000000     0.000000     0.000000     100.000000
            Herat      43.750000    31.250000    56.250000      68.750000
            Kabul      18.421053    81.060606    81.578947      18.939394
            Kandahar    0.000000    75.000000   100.000000      25.000000
...                          ...          ...          ...            ...
Zambia      Mansa      75.000000    25.000000    25.000000      75.000000
Zimbabwe    Bindura    50.000000    75.000000    50.000000      25.000000
            Bulawayo   67.857143    71.428571    32.142857      28.571429
            Harare     38.461538    87.500000    61.538462      12.500000
            Masvingo   25.000000    62.500000    75.000000      37.500000

[3895 rows x 4 columns]

SWAPLevel

In [ ]:
# swaplevel - darajalarni o'zgartirish

In [31]:
df3.swaplevel('Country','City')

Object                       AIR                     WATER
Info                  AirQuality AirPollution WaterQuality WaterPollution
City     Country
Andkhoy  Afghanistan   50.000000    50.000000    50.000000      50.000000
Farah    Afghanistan  100.000000     0.000000     0.000000     100.000000
Herat    Afghanistan   43.750000    31.250000    56.250000      68.750000
Kabul    Afghanistan   18.421053    81.060606    81.578947      18.939394
Kandahar Afghanistan    0.000000    75.000000   100.000000      25.000000
...                          ...          ...          ...            ...
Mansa    Zambia        75.000000    25.000000    25.000000      75.000000
Bindura  Zimbabwe      50.000000    75.000000    50.000000      25.000000
Bulawayo Zimbabwe      67.857143    71.428571    32.142857      28.571429
Harare   Zimbabwe      38.461538    87.500000    61.538462      12.500000
Masvingo Zimbabwe      25.000000    62.500000    75.000000      37.500000

[3895 rows x 4 columns]

In [35]:
df3.sort_index(level=0,ascending=False)

Object                       AIR                     WATER
Info                  AirQuality AirPollution WaterQuality WaterPollution
Country     City
Zimbabwe    Masvingo   25.000000    62.500000    75.000000      37.500000
            Harare     38.461538    87.500000    61.538462      12.500000
            Bulawayo   67.857143    71.428571    32.142857      28.571429
            Bindura    50.000000    75.000000    50.000000      25.000000
Zambia      Mansa      75.000000    25.000000    25.000000      75.000000
...                          ...          ...          ...            ...
Afghanistan Kandahar    0.000000    75.000000   100.000000      25.000000
            Kabul      18.421053    81.060606    81.578947      18.939394
            Herat      43.750000    31.250000    56.250000      68.750000
            Farah     100.000000     0.000000     0.000000     100.000000
            Andkhoy    50.000000    50.000000    50.000000      50.000000

[3895 rows x 4 columns]